# CreateCustomObjectN

## Description
Creates a custom object instance at specified location and angle of rotation.  The calling function can also set whether the pref dialog should appear.

```pascal
FUNCTION CreateCustomObjectN(
				objectName    : STRING;
				p             : REAL;
				rotationAngle : REAL;
				showPref      : BOOLEAN) : HANDLE;
```

```python

def vs.CreateCustomObjectN(objectName, p, rotationAngle, showPref):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectName|STRING|Name of object.|
|p|REAL|Insertion point of object instance.|
|rotationAngle|REAL|Rotation angle (in degrees) of object instance. |
|showPref|BOOLEAN|Show the Object Properties dialog.|

## Examples
```pascal
PROCEDURE Example;

VAR

   h :HANDLE;

BEGIN

   h := CreateCustomObjectN('Door', 0, 0, 0, False);

END;

RUN(Example);
```

## Version
Availability: from VectorWorks10.0
## Category
* Objects - Custom